app/Models/LoginModel.php

SELECT *
FROM `contact_us`
 LIMIT 20, 20
---
    public function showContact($perPage = 20, $offset = 0)
    {
       $builder= $this->db->table('contact_us');
        $builder->limit($perPage, $offset);

        $query = $builder->get();

SELECT COUNT(*) as total
FROM `contact_us`
---
    public function getPager($perPage = 20, $currentPage = 1)
    {
        $builder = $this->db->table('contact_us');
        $builder->select('COUNT(*) as total');

        $totalQuery = $builder->get();

SELECT *
FROM `categories`
---
    public function getCatData()
    {
        return $this->db->table('categories')
            ->get()
            ->getResultArray();

SELECT *
FROM `slider`
---
    public function getSlider()
    {
        return $this->db->table('slider')
            ->get()
            ->getResultArray();

SELECT `projects`.*, GROUP_CONCAT(images.image) as images
FROM `projects`
LEFT JOIN `images` ON `images`.`idProject` = `projects`.`id`
GROUP BY `projects`.`id`
---
    public function getCombinedData()
    {
        return $this->db->table('projects')
            ->select('projects.*, GROUP_CONCAT(images.image) as images')
            ->join('images', 'images.idProject = projects.id', 'left')
            ->groupBy('projects.id')
            ->get()
            ->getResultArray();

SELECT *
FROM `user_review`
 LIMIT 20
---
    public function getReview($perPage =20, $offset=0)
    {
        $builder = $this->db->table('user_review');
        $builder->limit($perPage, $offset);
        $query=$builder->get();

SELECT *
FROM `blogs`
---
    public function getBlog()
    {
        return $this->db->table('blogs')->get()->getResultArray();